f = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
            6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}

o = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок',
            50: 'пятьдесят', 60: 'шестьдесят', 70: 'семьдесят',
            80: 'восемьдесят', 90: 'девяносто'}

s = {11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
            14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
            17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}

h = {100: 'сто', 200: 'двести', 300: 'триста', 400: 'четыреста', 500: 'пятьсот', 
            600: 'шестьсот', 700: 'семьсот', 800: 'восемьсот', 900: 'девятьсот'}

t = {1000: 'тысяча', 2000: 'две тысячи', 3000: 'три тысячи', 4000: 'четыре тысячи', 
            5000: 'пять тысяч', 6000: 'шесть тысяч', 7000: 'семь тысяч', 8000: 'восемь тысячи',
            9000: 'девять тысяч'}

def do_sta(n):
    n1 = n % 10
    n2 = n - n1
    if n < 10:
        return f.get(n)
    elif 10 < n < 20:
        return s.get(n)
    elif n >= 10 and n in o:
        return o.get(n) 
    else:
        return o.get(n2) + ' ' + f.get(n1)

def do_tisyachi(n):
    n1 = n % 100
    n2 = n - n1
    if n >= 100 and n in h:
        return h.get(n)
    else:
        return h.get(n2) + ' ' + do_sta(n1) 

def do_ten_tisyachi(n):
    n1 = n % 1000
    n2 = n - n1
    if n >= 1000 and n in t:
        return t.get(n)
    else:
        return t.get(n2) + ' ' + do_tisyachi(n1) 

